# Importing Required Libraries

In [2]:
import pandas as pd

# Loading Sample Data

In [44]:
sample_df = pd.read_excel('sampledatafoodsales.xlsx', sheet_name='FoodSales')
sample_df

,ID,Date,Region,City,Category,Product,Qty,UnitPrice,TotalPrice
0,ID07351,2022-01-01,East,Boston,Bars,Carrot,33,1.77,58.41
1,ID07352,2022-01-04,East,Boston,Crackers,Whole Wheat,87,3.49,303.63
2,ID07353,2022-01-07,West,Los Angeles,Cookies,Chocolate Chip,58,1.87,108.46
3,ID07354,2022-01-10,East,New York,Cookies,Chocolate Chip,82,1.87,153.34
4,ID07355,2022-01-13,East,Boston,Cookies,Arrowroot,38,2.18,82.84
...,...,...,...,...,...,...,...,...,...
239,ID07590,2023-12-18,East,Boston,Cookies,Arrowroot,34,2.18,74.12
240,ID07591,2023-12-21,East,Boston,Cookies,Chocolate Chip,245,1.87,458.15
241,ID07592,2023-12-24,East,Boston,Crackers,Whole Wheat,30,3.49,104.70
242,ID07593,2023-12-27,West,Los Angeles,Bars,Bran,30,1.87,56.10
243,ID07594,2023-12-30,West,Los Angeles,Cookies,Oatmeal Raisin,44,2.84,124.96

# Pandas Dataframes

## Creating dataframe (df) from dictionary

In [23]:
df = pd.DataFrame(data={'a':[1, 2], 'b':[3, 4]})
df

   a  b
0  1  3
1  2  4

In [24]:
df = pd.DataFrame(data={'a':[1, 2], 'b':[3, 4]}, index=['i', 'ii'])
df

    a  b
i   1  3
ii  2  4

In [33]:
type(df)

pandas.core.frame.DataFrame

## Creating df from a Pandas Series (ds)

In [38]:
ds = pd.Series([1, 2, 3, 4, 5])
ds

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
type(ds)

pandas.core.series.Series

In [39]:
df = pd.DataFrame(ds)
df

   0
0  1
1  2
2  3
3  4
4  5

In [41]:
df = pd.DataFrame(ds, columns=['col_1'])
df

   col_1
0      1
1      2
2      3
3      4
4      5

## Dataframe Summary

In [48]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          244 non-null    object
 1   Date        244 non-null    datetime64[ns]
 2   Region      244 non-null    object
 3   City        244 non-null    object
 4   Category    244 non-null    object
 5   Product     244 non-null    object
 6   Qty         244 non-null    int64
 7   UnitPrice   244 non-null    float64
 8   TotalPrice  244 non-null    float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 17.3+ KB

## Dataframe Type

In [49]:
type(sample_df)

pandas.core.frame.DataFrame

## Columnwise Datatypes in the df

In [50]:
sample_df.dtypes

ID                    object
Date          datetime64[ns]
Region                object
City                  object
Category              object
Product               object
Qty                    int64
UnitPrice            float64
TotalPrice           float64
dtype: object

## To get Top ‘n’ rows of a df

In [52]:
sample_df.head()

,ID,Date,Region,City,Category,Product,Qty,UnitPrice,TotalPrice
0,ID07351,2022-01-01,East,Boston,Bars,Carrot,33,1.77,58.41
1,ID07352,2022-01-04,East,Boston,Crackers,Whole Wheat,87,3.49,303.63
2,ID07353,2022-01-07,West,Los Angeles,Cookies,Chocolate Chip,58,1.87,108.46
3,ID07354,2022-01-10,East,New York,Cookies,Chocolate Chip,82,1.87,153.34
4,ID07355,2022-01-13,East,Boston,Cookies,Arrowroot,38,2.18,82.84

In [53]:
sample_df.head(7)

,ID,Date,Region,City,Category,Product,Qty,UnitPrice,TotalPrice
0,ID07351,2022-01-01,East,Boston,Bars,Carrot,33,1.77,58.41
1,ID07352,2022-01-04,East,Boston,Crackers,Whole Wheat,87,3.49,303.63
2,ID07353,2022-01-07,West,Los Angeles,Cookies,Chocolate Chip,58,1.87,108.46
3,ID07354,2022-01-10,East,New York,Cookies,Chocolate Chip,82,1.87,153.34
4,ID07355,2022-01-13,East,Boston,Cookies,Arrowroot,38,2.18,82.84
5,ID07356,2022-01-16,East,Boston,Bars,Carrot,54,1.77,95.58
6,ID07357,2022-01-19,East,Boston,Crackers,Whole Wheat,149,3.49,520.01

## To get Last ‘n’ rows of a df

In [54]:
sample_df.tail()

,ID,Date,Region,City,Category,Product,Qty,UnitPrice,TotalPrice
239,ID07590,2023-12-18,East,Boston,Cookies,Arrowroot,34,2.18,74.12
240,ID07591,2023-12-21,East,Boston,Cookies,Chocolate Chip,245,1.87,458.15
241,ID07592,2023-12-24,East,Boston,Crackers,Whole Wheat,30,3.49,104.70
242,ID07593,2023-12-27,West,Los Angeles,Bars,Bran,30,1.87,56.10
243,ID07594,2023-12-30,West,Los Angeles,Cookies,Oatmeal Raisin,44,2.84,124.96

In [55]:
sample_df.tail(7)

,ID,Date,Region,City,Category,Product,Qty,UnitPrice,TotalPrice
237,ID07588,2023-12-12,East,New York,Crackers,Whole Wheat,25,3.49,87.25
238,ID07589,2023-12-15,West,San Diego,Cookies,Chocolate Chip,96,1.87,179.52
239,ID07590,2023-12-18,East,Boston,Cookies,Arrowroot,34,2.18,74.12
240,ID07591,2023-12-21,East,Boston,Cookies,Chocolate Chip,245,1.87,458.15
241,ID07592,2023-12-24,East,Boston,Crackers,Whole Wheat,30,3.49,104.70
242,ID07593,2023-12-27,West,Los Angeles,Bars,Bran,30,1.87,56.10
243,ID07594,2023-12-30,West,Los Angeles,Cookies,Oatmeal Raisin,44,2.84,124.96